{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      "[MASK]": 4,
      "aaa": 5,
      "aac": 6,
      "aag": 7,
      "aau": 8,
      "aca": 9,
      "acc": 10,
      "acg": 11,
      "acu": 12,
      "aga": 13,
      "agc": 14,
      "agg": 15,
      "agu": 16,
      "aua": 17,
      "auc": 18,
      "aug": 19,
      "auu": 20,
      "caa": 21,
      "cac": 22,
      "cag": 23,
      "cau": 24,
      "cca": 25,
      "ccc": 26,
      "ccg": 27,
      "ccu": 28,
      "cga": 29,
      "cgc": 30,
      "cgg": 31,
      "cgu": 32,
      "cua": 33,
      "cuc": 34,
      "cug": 35,
      "cuu": 36,
      "gaa": 37,
      "gac": 38,
      "gag": 39,
      "gau": 40,
      "gca": 41,
      "gcc": 42,
      "gcg": 43,
      "gcu": 44,
      "gga": 45,
      "ggc": 46,
      "ggg": 47,
      "ggu": 48,
      "gua": 49,
      "guc": 50,
      "gug": 51,
      "guu": 52,
      "uaa": 53,
      "uac": 54,
      "uag": 55,
      "uau": 56,
      "uca": 57,
      "ucc": 58,
      "ucg": 59,
      "ucu": 60,
      "uga": 61,
      "ugc": 62,
      "ugg": 63,
      "ugu": 64,
      "uua": 65,
      "uuc": 66,
      "uug": 67,
      "uuu": 68
    },
    "unk_token": "[UNK]"
  }
}