{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      "[MASK]": 4,
      "aaa": 5,
      "aac": 6,
      "aag": 7,
      "aat": 8,
      "aca": 9,
      "acc": 10,
      "acg": 11,
      "act": 12,
      "aga": 13,
      "agc": 14,
      "agg": 15,
      "agt": 16,
      "ata": 17,
      "atc": 18,
      "atg": 19,
      "att": 20,
      "caa": 21,
      "cac": 22,
      "cag": 23,
      "cat": 24,
      "cca": 25,
      "ccc": 26,
      "ccg": 27,
      "cct": 28,
      "cga": 29,
      "cgc": 30,
      "cgg": 31,
      "cgt": 32,
      "cta": 33,
      "ctc": 34,
      "ctg": 35,
      "ctt": 36,
      "gaa": 37,
      "gac": 38,
      "gag": 39,
      "gat": 40,
      "gca": 41,
      "gcc": 42,
      "gcg": 43,
      "gct": 44,
      "gga": 45,
      "ggc": 46,
      "ggg": 47,
      "ggt": 48,
      "gta": 49,
      "gtc": 50,
      "gtg": 51,
      "gtt": 52,
      "taa": 53,
      "tac": 54,
      "tag": 55,
      "tat": 56,
      "tca": 57,
      "tcc": 58,
      "tcg": 59,
      "tct": 60,
      "tga": 61,
      "tgc": 62,
      "tgg": 63,
      "tgt": 64,
      "tta": 65,
      "ttc": 66,
      "ttg": 67,
      "ttt": 68
    },
    "unk_token": "[UNK]"
  }
}